agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_flexcan.c
static uint32_t mcxa1xx_waitmcr_change(uint32_t base, uint32_t mask,
                                       uint32_t target_state)
{
  const uint32_t timeout = 1000;
  uint32_t wait_ack;

  for (wait_ack = 0; wait_ack < timeout; wait_ack++)
    {
      const bool state = (getreg32(base + MCXA1XX_CAN_MCR_OFFSET) & mask)
          != 0;
      if (state == target_state)
        {
          return true;
        }

      up_udelay(10);
    }

  return false;
}

static uint32_t mcxa1xx_waitfreezeack_change(uint32_t base,
                                             uint32_t target_state)
{
  return mcxa1xx_waitmcr_change(base, CAN_MCR_FRZACK, target_state);
}

/****************************************************************************
 * Function: mcxa1xx_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int mcxa1xx_ifup(struct net_driver_s *dev)
{
  struct mcxa1xx_driver_s *priv = (struct mcxa1xx_driver_s *)dev->d_private;

  if (!mcxa1xx_initialize(priv))
    {
      nerr("initialize failed");
      return -1;
    }

  /* Exit freeze mode */

  mcxa1xx_setfreeze(priv->base, 0);
  if (!mcxa1xx_waitfreezeack_change(priv->base, 0))
    {
      ninfo("FLEXCAN: unfreeze fail\n");
      return -1;
    }

  priv->bifup = true;

#ifdef CONFIG_NET_CAN_CANFD
  priv->txdesc = (struct canfd_frame *)&g_tx_pool;
  priv->rxdesc = (struct canfd_frame *)&g_rx_pool;
#else
  priv->txdesc = (struct can_frame *)&g_tx_pool;
  priv->rxdesc = (struct can_frame *)&g_rx_pool;
#endif

  priv->dev.d_buf = (uint8_t *)priv->txdesc;

  /* Set interrupts */

  if (priv->config->bus_irq > 0)
    {
      up_enable_irq(priv->config->bus_irq);
    }

  if (priv->config->error_irq > 0)
    {
      up_enable_irq(priv->config->error_irq);
    }

  if (priv->config->lprx_irq > 0)
    {
      up_enable_irq(priv->config->lprx_irq);
    }

  up_enable_irq(priv->config->mb_irq);

  /* Indicate can turned on */

  if (priv->config->led_pin > 0)
    {
      mcxa1xx_port_configure(priv->config->led_pin);
      mcxa1xx_gpiowrite(priv->config->led_pin, priv->config->led_high);
    }

  return OK;
}

/****************************************************************************
 * Function: mcxa1xx_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int mcxa1xx_ifdown(struct net_driver_s *dev)
{
  struct mcxa1xx_driver_s *priv = (struct mcxa1xx_driver_s *)dev->d_private;

  mcxa1xx_reset(priv);

  priv->bifup = false;

  /* Indicate can turned off */

  if (priv->config->led_pin > 0)
    {
      mcxa1xx_port_configure(priv->config->led_pin);
      mcxa1xx_gpiowrite(priv->config->led_pin, !priv->config->led_high);
    }

  return OK;
}

/****************************************************************************
 * Function: mcxa1xx_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called on the higher priority worker thread.
 *
 ****************************************************************************/

static void mcxa1xx_txavail_work(void *arg)
{
  struct mcxa1xx_driver_s *priv = (struct mcxa1xx_driver_s *)arg;

  /* Ignore the notification if the interface is not yet up */

  net_lock();
  if (priv->bifup)
    {
      /* Check if there is room in the hardware to hold another outgoing
       * packet.
       */

      if (!mcxa1xx_txringfull(priv))
        {
          /* No, there is space for another transfer.  Poll the network for
           * new XMIT data.
           */

          if (!mcxa1xx_txringfull(priv))
            {
              devif_poll(&priv->dev, mcxa1xx_txpoll);
            }
        }
    }

  net_unlock();
}

/****************************************************************************
 * Function: mcxa1xx_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int mcxa1xx_txavail(struct net_driver_s *dev)
{
  struct mcxa1xx_driver_s *priv = (struct mcxa1xx_driver_s *)dev->d_private;

  /* Is our single work structure available?  It may not be if there are
   * pending interrupt actions and we will have to ignore the Tx
   * availability action.
   */

  if (work_available(&priv->pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      mcxa1xx_txavail_work(priv);
    }

  return OK;
}

/****************************************************************************
 * Function: mcxa1xx_ioctl
 *
 * Description:
 *   PHY ioctl command handler
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   cmd  - ioctl command
 *   arg  - Argument accompanying the command
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NETDEV_IOCTL
static int mcxa1xx_ioctl(struct net_driver_s *dev, int cmd,
                         unsigned long arg)
{
  struct mcxa1xx_driver_s *priv = (struct mcxa1xx_driver_s *)dev->d_private;

  int ret;

  switch (cmd)
    {
#ifdef CONFIG_NETDEV_CAN_IOCTL
      case SIOCGCANBITRATE: /* Get bitrate from a CAN controller */
        {
          struct can_ioctl_data_s *req =
              (struct can_ioctl_data_s *)((uintptr_t)arg);
          req->arbi_bitrate = priv->arbi_timing.bitrate;
          req->arbi_samplep = priv->arbi_timing.samplep;
#ifdef CONFIG_NET_CAN_CANFD
          req->data_bitrate = priv->data_timing.bitrate;
          req->data_samplep = priv->data_timing.samplep;
#else
          req->data_bitrate = 0;
          req->data_samplep = 0;
#endif
          ret = OK;
        }
        break;

      case SIOCSCANBITRATE: /* Set bitrate of a CAN controller */
        {
          struct can_ioctl_data_s *req =
              (struct can_ioctl_data_s *)((uintptr_t)arg);

