agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_flexcan.c
  for (i = TXMBCOUNT; i < TOTALMBCOUNT; i++)
    {
      priv->rx[i].id.w = 0x0;

      /* FIXME sometimes we get a hard fault here */
    }

  putreg32(0x0, priv->base + MCXA1XX_CAN_RXFGMASK_OFFSET);

  for (i = 0; i < priv->config->no_buffers; i++)
    {
      putreg32(0, priv->base + MCXA1XX_CAN_RXIMR_OFFSET(i));
    }

  for (i = 0; i < RXMBCOUNT; i++)
    {
      ninfo("Set MB%" PRIu32 " to receive %p\n", i, &priv->rx[i]);
      priv->rx[i].id.w = 0x0;
      priv->rx[i].cs.edl = 0x1;
      priv->rx[i].cs.brs = 0x1;
      priv->rx[i].cs.esi = 0x0;
      priv->rx[i].cs.code = 0x4;
      priv->rx[i].cs.srr = 0x0;
      priv->rx[i].cs.ide = 0x1;
      priv->rx[i].cs.rtr = 0x0;
    }

  putreg32(IFLAG1_RX, priv->base + MCXA1XX_CAN_IFLAG1_OFFSET);
  putreg32(IFLAG1_RX, priv->base + MCXA1XX_CAN_IMASK1_OFFSET);

  /* Exit freeze mode */

  mcxa1xx_setfreeze(priv->base, 0);
  if (!mcxa1xx_waitfreezeack_change(priv->base, 0))
    {
      ninfo("FLEXCAN: unfreeze fail\n");
      return -1;
    }

  return 1;
}

/****************************************************************************
 * Function: mcxa1xx_reset
 *
 * Description:
 *   Put the EMAC in the non-operational, reset state
 *
 * Input Parameters:
 *   priv - Reference to the private FLEXCAN driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void mcxa1xx_reset(struct mcxa1xx_driver_s *priv)
{
  uint32_t regval;
  uint32_t i;

  regval  = getreg32(priv->base + MCXA1XX_CAN_MCR_OFFSET);
  regval |= CAN_MCR_SOFTRST;
  putreg32(regval, priv->base + MCXA1XX_CAN_MCR_OFFSET);

  if (!mcxa1xx_waitmcr_change(priv->base, CAN_MCR_SOFTRST, 0))
    {
      nerr("Reset failed");
      return;
    }

  regval  = getreg32(priv->base + MCXA1XX_CAN_MCR_OFFSET);
  regval &= ~(CAN_MCR_SUPV);
  putreg32(regval, priv->base + MCXA1XX_CAN_MCR_OFFSET);

  /* Initialize all MB rx and tx */

  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      ninfo("MB %" PRIu32 " %p\n", i, &priv->rx[i]);
      ninfo("MB %" PRIu32 " %p\n", i, &priv->rx[i].id.w);
      priv->rx[i].cs.cs = 0x0;
      priv->rx[i].id.w = 0x0;
      priv->rx[i].data[0].w00 = 0x0;
      priv->rx[i].data[1].w00 = 0x0;
    }

  regval  = getreg32(priv->base + MCXA1XX_CAN_MCR_OFFSET);
  regval |= CAN_MCR_WRNEN | CAN_MCR_SRXDIS |
            CAN_MCR_IRMQ | CAN_MCR_AEN |
            (((TOTALMBCOUNT - 1) << CAN_MCR_MAXMB_SHIFT) &
            CAN_MCR_MAXMB_MASK);
  putreg32(regval, priv->base + MCXA1XX_CAN_MCR_OFFSET);

  regval  = CAN_CTRL2_RRS | CAN_CTRL2_EACEN;
  putreg32(regval, priv->base + MCXA1XX_CAN_CTRL2_OFFSET);

  for (i = 0; i < TOTALMBCOUNT; i++)
    {
      putreg32(0, priv->base + MCXA1XX_CAN_RXIMR_OFFSET(i));
    }

  /* Filtering catchall */

  putreg32(0x3fffffff, priv->base + MCXA1XX_CAN_RX14MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + MCXA1XX_CAN_RX15MASK_OFFSET);
  putreg32(0x3fffffff, priv->base + MCXA1XX_CAN_RXMGMASK_OFFSET);
  putreg32(0x0, priv->base + MCXA1XX_CAN_RXFGMASK_OFFSET);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: mcxa1xx_caninitialize
 *
 * Description:
 *   Initialize the CAN controller and driver
 *
 * Input Parameters:
 *   intf - In the case where there are multiple CAN devices, this value
 *          identifies which CAN device is to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int mcxa1xx_caninitialize(int intf)
{
  struct mcxa1xx_driver_s *priv;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_MCXA1XX_FLEXCAN0
    case 0:
      priv               = &g_flexcan0;
      memset(priv, 0, sizeof(struct mcxa1xx_driver_s));
      priv->base         = MCXA1XX_FLEXCAN0_BASE;
      priv->config       = &mcxa1xx_flexcan0_config;
      priv->clk_freq     = BOARD_FLEXCAN_FREQUENCY;

      /* Select the FlexCAN functional clock and open its gate. The source
       * must be selected before the gate is opened.
       */

      mcxa1xx_set_periphclock(MCXA1XX_MRCC_FLEXCAN0_CLKSEL,
                              MCXA1XX_MRCC_FLEXCAN0_CLKDIV,
                              BOARD_FLEXCAN_CLKSEL, BOARD_FLEXCAN_CLKDIV);
      mcxa1xx_set_clock_gate(CLOCK_GATE_FLEXCAN0, true);

      /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN0_ARBI_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN0_ARBI_SAMPLEP;
      priv->data_timing.bitrate = CONFIG_FLEXCAN0_DATA_BITRATE;
      priv->data_timing.samplep = CONFIG_FLEXCAN0_DATA_SAMPLEP;
#  else
      priv->arbi_timing.bitrate = CONFIG_FLEXCAN0_BITRATE;
      priv->arbi_timing.samplep = CONFIG_FLEXCAN0_SAMPLEP;
#  endif
      break;
#endif






    default:
      return -ENODEV;
    }

  if (!mcxa1xx_bitratetotimeseg(&priv->arbi_timing, 1, 0, priv->clk_freq))
    {
      nerr("ERROR: Invalid CAN timings please try another sample point "
           "or refer to the reference manual\n");
      return -1;
    }

#ifdef CONFIG_NET_CAN_CANFD
  if (!mcxa1xx_bitratetotimeseg(&priv->data_timing, 1, 1, priv->clk_freq))
    {
      nerr("ERROR: Invalid CAN data phase timings please try another "
           "sample point or refer to the reference manual\n");
      return -1;
    }
#endif

  mcxa1xx_port_configure(priv->config->tx_pin);
  mcxa1xx_port_configure(priv->config->rx_pin);
  if (priv->config->enable_pin > 0)
    {
      mcxa1xx_port_configure(priv->config->enable_pin);
      mcxa1xx_gpiowrite(priv->config->enable_pin, priv->config->enable_high);
    }

  if (priv->config->stb_pin > 0)
    {
      mcxa1xx_port_configure(priv->config->stb_pin);
      mcxa1xx_gpiowrite(priv->config->stb_pin, priv->config->stb_high);
    }

  /* Attach the flexcan interrupt handler */

