agam-robotics/NuttX/arch/arm/src/mcxa1xx/mcxa1xx_flexcan.c
  if (priv->config->bus_irq > 0)
      {
      if (irq_attach(priv->config->bus_irq, mcxa1xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN bus IRQ\n");
          return -EAGAIN;
        }
      }

  if (priv->config->error_irq > 0)
      {
      if (irq_attach(priv->config->error_irq,
                     mcxa1xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN error IRQ\n");
          return -EAGAIN;
        }
      }

  if (priv->config->lprx_irq > 0)
    {
      if (irq_attach(priv->config->lprx_irq,
                     mcxa1xx_flexcan_interrupt, priv))
        {
          /* We could not attach the ISR to the interrupt */

          nerr("ERROR: Failed to attach CAN LPRX IRQ\n");
          return -EAGAIN;
        }
    }

  if (irq_attach(priv->config->mb_irq, mcxa1xx_flexcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      nerr("ERROR: Failed to attach CAN OR'ed Message buffer (0-15) IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  priv->dev.d_ifup    = mcxa1xx_ifup;      /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = mcxa1xx_ifdown;    /* I/F down callback */
  priv->dev.d_txavail = mcxa1xx_txavail;   /* New TX data callback */
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = mcxa1xx_ioctl;     /* Support CAN ioctl() calls */
#endif
  priv->dev.d_private = priv;              /* Used to recover private state from dev */
  priv->rx            = (struct mb_s *)(priv->base + MCXA1XX_CAN_MB_OFFSET);
  priv->tx            = (struct mb_s *)(priv->base + MCXA1XX_CAN_MB_OFFSET +
                          (sizeof(struct mb_s) * RXMBCOUNT));

  /* Put the interface in the down state.  This usually amounts to resetting
   * the device and/or calling mcxa1xx_ifdown().
   */

  ninfo("callbacks done\n");

  mcxa1xx_initialize(priv);

  mcxa1xx_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_CAN);

  UNUSED(ret);
  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the enabled CAN device interfaces.  If there are more
 *   different network devices in the chip, then board-specific logic will
 *   have to provide this function to determine which, if any, network
 *   devices should be initialized.
 *
 ****************************************************************************/

#if !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
#ifdef CONFIG_MCXA1XX_FLEXCAN0
  mcxa1xx_caninitialize(0);
#endif





}
#endif

#endif /* CONFIG_MCXA1XX_FLEXCAN */
